Tekla Open API Reference for Tekla Structures 2025
BaseRebarModifier.FollowEdges Property
 Gets or sets a flag that indicates whether the modifier should attempt to follow the leg face edges located between its end points.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool FollowEdges { get; set; }
Public Property FollowEdges As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
BaseRebarModifier Class
Tekla.Structures.Model Namespace